日程安排/2020/34week_ecc_ecdh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 四 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ecc.ecdh</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'/>
</head>
<body>
<div id="content">
<h1 class="title">ecc.ecdh</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb08d2c5">1. 介绍</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb08d2c5" class="outline-2">
<h2 id="orgb08d2c5"><span class="section-number-2">1</span> 介绍</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
秘钥生成
</p>
<div class="org-src-container">
<pre class="src src-go">    <span style="color: #6f7787;">// </span><span style="color: #6f7787;">GenerateKey generates a public and private key pair.</span>
<span style="color: #81A1C1;">func</span> <span style="color: #8FBCBB;">GenerateKey</span>(<span style="color: #D8DEE9;">c</span> <span style="color: #8FBCBB;">elliptic.Curve</span>, <span style="color: #D8DEE9;">rand</span> <span style="color: #8FBCBB;">io.Reader</span>) (*<span style="color: #8FBCBB;">PrivateKey</span>, <span style="color: #8FBCBB;">error</span>) {
        <span style="color: #D8DEE9;">k</span>, <span style="color: #D8DEE9;">err</span> := <span style="color: #8FBCBB;">randFieldElement</span>(c, rand)
        <span style="color: #81A1C1;">if</span> err != <span style="color: #81A1C1;">nil</span> {
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">nil</span>, err
        }

        <span style="color: #D8DEE9;">priv</span> := <span style="color: #81A1C1;">new</span>(<span style="color: #8FBCBB;">PrivateKey</span>)
        priv.PublicKey.Curve = c
        priv.D = k
        priv.PublicKey.X, priv.PublicKey.Y = c.<span style="color: #8FBCBB;">ScalarBaseMult</span>(k.<span style="color: #8FBCBB;">Bytes</span>())
        <span style="color: #81A1C1;">return</span> priv, <span style="color: #81A1C1;">nil</span>
}
</pre>
</div>
<p>
传入一个 椭圆曲线 和一个 io.reader 会得到一个 private
</p>
<div class="org-src-container">
<pre class="src src-go"> <span style="color: #81A1C1;">type</span> <span style="color: #8FBCBB;">PrivateKey</span> <span style="color: #81A1C1;">struct</span> {
     PublicKey
     D *<span style="color: #8FBCBB;">big.Int</span>
}
</pre>
</div>

<p>
生成公钥 私钥
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #D8DEE9;">private</span>, <span style="color: #D8DEE9;">err</span> := ecdsa.<span style="color: #8FBCBB;">GenerateKey</span>(elliptic.<span style="color: #8FBCBB;">P256</span>(),rand.Reader)

<span style="color: #81A1C1;">if</span> err != <span style="color: #81A1C1;">nil</span>{
<span style="color: #6f7787;">//</span><span style="color: #6f7787;">todo</span>
}
<span style="color: #D8DEE9;">public</span> := private.PublicKey
</pre>
</div></li>

<li>针对eth的椭圆曲线
图像为 : y2 = x3 +ax + b
上文使用的是p256 而 相同的还有p521 p384 &#x2026;
差别 : 是素数的不同(越大椭圆就会越大).
      在代码里面 initP256 会定义 对于每个椭圆点的最大值
所以在得到一个椭圆曲线以后,会确定a 和 b 的值,像spec265k1 a=0 b=7,
在生成私钥时 会使用rand.Reader 生成随机数  做为公钥
在eth 中 G 值 是确定的 所以公钥的生成 是 使用G值的去乘以 我们锁定私钥的x,y
假定 我们的私钥是 P(x,y) 使用的曲线是 spec256k1 G是一个固定值</li>

<li>加密</li>
</ul>


<ul class="org-ul">
<li>签名</li>

<li>验证</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-12-02</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2020-12-03 四 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
